[
    {
        "text": "DeepSeek-R1 just arrived, the world's most powerful open source AI model.\ndelivering performance on par with OpenAI-o1 and outperforming Claude 3.5 Sonnet and o1-mini in most benchmarks. 📈\nFully open-source and MIT licensed, it empowers anyone to distill, commercialize, and innovate.\n\nKey Highlights:\nSmall & Powerful: Six distilled models (32B & 70B) perform competitively with OpenAI-o1-mini.\nRevolutionary Training: Achieves top-tier performance purely through reinforcement learning, no supervised fine-tuning—AlphaZero style.\n\nThe open-source community now has access to something truly extraordinary:\nFree use of model weights and API outputs for fine-tuning.\nNo walled gardens—only shared progress.\n\nIt’s a bold reminder that transformative AI doesn’t have to live behind a paywall and these super powerful tools need to be developed closely with community involvements.🔥\n\nIf you are a leader looking for more practical guidance, check this executive Course by top AI educators/practitioners. https://bit.ly/4gdSEn4\n\nhashtag#innovation hashtag#GenerativeAI",
        "likes": 435,
        "line_count": 11,
        "language": "English",
        "tags": [
            "#innovation",
            "#GenerativeAI"
        ]
    },
    {
        "text": "Foundations of LLMs is an awesome new book just released!\nThe content covers the foundational concepts of large language models. Here's an overview of the chapters:\n\n1️⃣Pre-training: The core idea of pre-training NLP models, the history and techniques (e.g., supervised, unsupervised, and self-supervised learning), and detailed methods such as masked and permuted language modeling.\n2️⃣Generative Models: Explores how large language models are constructed, scaled, and fine-tuned for generating human-like text.\n3️⃣Prompting Methods: Covers various strategies to guide language models to perform specific tasks using prompts, including advanced techniques like chain-of-thought reasoning.\n4️⃣Alignment: Focuses on methods to align large language models with human values and tasks through instruction fine-tuning and reinforcement learning from human feedback (RLHF).\n\nI just had a chance to briefly check it out, very comprehensive! This is a perfect guide for understanding the mechanisms that make LLMs powerful, with insights into training strategies, applications, and future potential.\n\nIf you are a leader looking for more practical guidance, check this executive Course by top AI educators/practitioners. https://bit.ly/4gdSEn4\n\nBy Tong Xiao and Jingbo Zhu\ndownload the full pdf here: https://lnkd.in/gtbBrd4v",
        "likes": 512,
        "line_count": 13,
        "language": "English",
        "tags": [
            "#LLMs",
            "#AI"
        ]
    },
    {
        "text": "📢Today, ChatGPT’s Agentic Era Begins with a Leap\n\nAI assistant doesn’t just respond—it proactively manages parts of your life. With the release of Tasks, OpenAI has just taken a significant step toward making this vision a reality.\n\nHere’s the story:\nThe new Tasks feature enables ChatGPT to schedule and execute actions for you, from one-time reminders to recurring routines. Whether it’s a daily list of the latest AI news, creating personalized workouts, or even a gentle nudge to learn a new word in your favorite language, Tasks is here to take productivity to the next level.\n\nWhy this is groundbreaking:\n✔Proactive AI: Tasks are a step beyond reactive interactions. ChatGPT can now anticipate your needs, acting more like an intelligent agent than a simple assistant.\n✔Personalized Automation: By suggesting recurring tasks based on your chat history, it’s learning how to be your go-to personal assistant.\n✔Efficiency Redefined: With up to 10 active tasks at once, you can offload repetitive tasks, freeing yourself for higher-value activities.\n\nSome Future Use Cases:\n1️⃣ Personalized Education: Daily language lessons or coding puzzles delivered seamlessly.\n2️⃣ Health Management: Reminders for medication, fitness plans, or mindfulness routines.\n3️⃣ Business Productivity: Scheduling team updates, generating daily reports, or even monitoring critical data trends.\n\nTasks are just the beginning. In future autonomous AI Agents will handle workflows, integrates deeply into tools, and becomes a trusted partner in personal and professional growth.\n\nI see this as a pivotal moment. We’re witnessing the evolution of AI from assistant to agent, from follower to proactive partner.\n\nWhat are your thoughts?\n\n📢We have spent last 2 months with a group of Generative AI thought leaders, top professors and C-Levels to make the ultimate AI for Executive course. The team is the Avengers of the AI world. here is the link for early birds: https://lnkd.in/gv-9r4xN",
        "likes": 623,
        "line_count": 26,
        "language": "English",
        "tags": [
            "#AI"
        ]
    },
    {
        "text": "I am fascinated with the AI Agent products released recently, this will be one of the major topics in 2025 and you should not miss it out:\n\n---Lets start with basics:\n1️⃣Agent Core: The central processing unit that integrates all functionalities, acting as the 'brain' of the agent.\n2️⃣Memory Module: Stores and retrieves information to maintain context and continuity over time, allowing the agent to learn from past interactions and adapt to new situations.\n3️⃣Perception Module: Collects and interprets data from the environment, enabling the agent to understand and respond to external inputs.\n4️⃣Planning Module: Analyzes problems and devises strategies to solve them, enabling the agent to set goals and determine the best course of action.\n5️⃣Action Module: Executes the planned actions, allowing the agent to interact with its environment and achieve its objectives.\n6️⃣Tools Integration: External resources and APIs the agent can use to perform specific tasks, extending its capabilities beyond its inherent functions.\n\n---Capabilities:\n1️⃣ Advanced Problem Solving: AI agents can plan and execute complex tasks, such as generating project plans, writing code, running benchmarks, and creating summaries.\n2️⃣ Self-Reflection and Improvement: AI agents can analyze their own output, identify problems, and provide constructive feedback. By incorporating this feedback and repeating the criticism/rewrite process, agents can continually improve their performance across various tasks.\n3️⃣ Tool Utilization: AI agents can use tools to evaluate their output, such as running unit tests on code to check for correctness or searching the web to verify text accuracy. This allows them to reflect on errors and propose improvements.\n4️⃣ Collaborative Multi-Agent Framework: Implementing a multi-agent framework, where one agent generates outputs, and another provides constructive criticism, leads to enhanced performance through iterative feedback and discussion.\n\n----Reasoning Frameworks:\n1️⃣Chain-of-Thought (CoT): Encourages the agent to decompose complex problems into a sequence of intermediate reasoning steps, enhancing problem-solving capabilities.\n2️⃣ReAct (Reasoning and Acting): Integrates reasoning and acting by allowing the agent to generate reasoning traces and task-specific actions in an interleaved manner, enabling dynamic decision-making.\n3️⃣Tree-of-Thoughts (ToT): Generalizes the CoT approach by enabling exploration over coherent units of text (thoughts) that serve as intermediate steps toward problem-solving, allowing for strategic lookahead and backtracking.\n\n📢I have spent last 2 months with a group of AI thought leaders, top professors and C levels to make the ultimate AI for Executive course. The team is the Avengers of the AI world. If you are interested to join as beta tester just comment \"AI Agents\"🔥\n\n📢Update: We picked 20 Beta testers, here is the link for early bird price only valid for 72 hours: https://bit.ly/4gdSEn4",
        "likes": 488,
        "line_count": 34,
        "language": "English",
        "tags": [
            "#AI",
            "#AI_Agents"
        ]
    },
    {
        "text": "Google totally overshadowing the 12 days of OpenAI's! 📢\"from google import genai\"!\n\nSo far, Google is the winner of the race in 2024! wdyt?\n\nJust released: Starting with Gemini 2.0, you can access our models and tools through ONE single SDK.\n🎙 Astra (AI Voice Assistant)\n-Real-time coaching in games (e.g. Clash of Clans).\n-Cooking guidance with visual feedback.\n-Multilingual, context-aware, and can recall info (e.g. door codes).\n\n📈 Project Mariner (Browser Automation)\n-Automates complex, multi-step web tasks.\n-Transparent reasoning, with pause/stop controls.\n-Ideal for contact searches, price checks, and product research.\n\n🖼 Gemini 2.0 (Multimodal AI)\n-Generates and edits images and text together.\n-Interprets drawn instructions and prompts seamlessly.\n-Enables complex visual co-creation (removing objects, scene changes).\n\n🎥 Google’s Video Generator Engine\n-Produces videos from text/image prompts.\n-High-quality, dynamic visuals for storytelling.\n\n🚀 Quantum Chip Advancements\n-Potential improvements in processing speeds, error correction, and scalability.\n-Could accelerate research in materials science, cryptography, and AI optimization.\n\nSome Use Cases Across Technologies:\n1️⃣ Streamlined cooking help with real-time feedback.\n2️⃣ Efficient travel planning and local route suggestions.\n3️⃣ Shopping assistance with automatic product recommendations.\n4️⃣ Multimodal co-creation for images, video content, and beyond.\n\nWith 2 days remaining from 12 days of openAI, this is far from over.\nIt is definitely a hot AI Christmas.",
        "likes": 541,
        "line_count": 24,
        "language": "English",
        "tags": [
            "#OpenAI",
            "#Google"
        ]
    },
    {
        "text": "New open-source physics AI engine is out of this world! 🤯 Genesis is a cutting-edge physics engine and simulation platform, developed over 24 months with input from 20 research labs to create dynamic 4D worlds for robotics and physics.\n\nIt’s built entirely in Python, yet outpaces existing GPU solutions—running up to 10–80x faster than Isaac Gym and similar tools. On an RTX 4090, it can process and simulate physics 430,000x faster than real-time.\n\nKey Features:\nUnified Physics Framework: Offers a single platform for Rigid Body, MPM, SPH, FEM, PBD, and Stable Fluid simulations.\nCross-Platform and Multi-Backend: Run on Linux, macOS, Windows, CPU, NVIDIA, AMD, and Apple Metal.\nRobotic and AI Applications: Seamlessly integrates with MJCF, URDF, OBJ, and GLB files, with broad support for robots—arms, legged systems, drones, soft robotics, and more.\nGenerative Capabilities: Automatically create environments, camera trajectories, policies, animations, and more from text prompts.\nDifferentiable Simulation: Currently available for MPM and Tool solvers, accelerating research and design.\nUltra-Fast Training: Achieve real-world-transferable robot locomotion policies in just 26 seconds.\nBuilt-in Photorealistic Ray-Tracing: For lifelike visualization and analysis.\n\nEmbodied AI is coming!\nGithub: https://lnkd.in/ggWxu--9\nOfficial web page: https://lnkd.in/ghfxDCrf",
        "likes": 477,
        "line_count": 23,
        "language": "English",
        "tags": [
            "#AI",
            "#physics"
        ]
    },
    {
        "text": "📢 Zuck joined Elon to oppose OpenAI's for-profit pivot! only for OpenAI to drop new evidence! 👀\n\nElon’s on a mission to stop OpenAI’s for-profit pivot, even calling on California’s AG to intervene, claiming it’s a betrayal of its nonprofit roots.\n\nNow Zuck who is the new cool kid on the block with all the open source projects jumped in, accusing OpenAI of straying from its original purpose—but let’s be real, Elon’s been at this fight long before it was cool.\n\nThe plot thickens as the co-founder who started it all to \"save humanity\" battles to keep it from becoming just another corporate money machine. And OpenAI just released these timelines and more screenshots of the conversations:\n▪ November 2015: OpenAI started as a nonprofit, which Elon questioned\n▪ December 2015: OpenAI publicly announced\n▪ Early 2017: Our research progress led us to realize we would need billions of dollars for the compute to build AGI\n▪ Summer 2017: We and Elon agreed that a for-profit was the next step for OpenAI to advance the mission\n▪ Fall 2017: Elon demanded majority equity, absolute control, and to be CEO of the for-profit\n▪ September 2017: Elon created the public benefit corporation called “Open Artificial Intelligence Technologies, Inc.”\n▪ September 2017: We rejected Elon's terms because giving him unilateral control of OpenAI and its technology would be contrary to the mission\n▪ January 2018: Elon said OpenAI was on a path for certain failure unless we merged into Tesla.\n▪ February 2018: Elon resigned as co-chair of OpenAI\n▪ December 2018: Elon told us to raise “billions per year immediately or forget it”\n▪ March 2019: We announced the capped-profit OpenAI LP, within the non-profit\n▪ March 2023: Elon started his OpenAI competitor, xAI\n\nRegardless of all these dramas, 12 days of OpenAI is bringing attention back to their new services.\n\nAlthough it seems that ChatGPT's performance almost plateaued, their other services adding better UI/UX changes the whole dynamics.\n\nEven after SORA I am not convinced with the hefty $200 per month price tag but cant deny Chatgpt plus is still a great value for the money.",
        "likes": 591,
        "line_count": 26,
        "language": "English",
        "tags": [
            "#OpenAI",
            "#ChatGPT"
        ]
    }
]